Repository: mshemuni/soon
Catalog: utils/locale/*/LC_MESSAGES/messages.po
Languages: tr

source: Please answer with 'y/yes' or 'n/no'.
tr: Lütfen 'e/evet' veya 'h/hayır' ile cevap verin.

source: Enter Django Secret Key (leave empty to generate one):
tr: Django Secret Key girin (otomatik oluşturmak için boş bırakın):

source: No secret key provided, generating one now
tr: Secret key girilmedi, şimdi oluşturuluyor

source: Enter Administrator's username:
tr: Yönetici kullanıcı adını girin:

source: Enter Administrator's password:
tr: Yönetici parolasını girin:

source: Enter path where the certificate files are stored:
tr: Sertifika dosyalarının bulunduğu yolu girin:

source: Enter controller (Leave empty to not set):
tr: Controller'ı girin (ayarlamak istemiyorsanız boş bırakın):

source: FDQN is not reachable
tr: FDQN'e erişilemiyor

source: Username is not set
tr: Kullanıcı adı ayarlı değil

source: Password is not set
tr: Parola ayarlı değil

source: Connection failed
tr: Bağlantı başarısız

source: File's content is:
tr: Dosyanın içeriği:

source: Backup created: {backup_path}
tr: Yedek oluşturuldu: {backup_path}

source: Making migrations...
tr: Migration dosyaları oluşturuluyor...

source: Migrating...
tr: Veritabanı migrasyonu uygulanıyor...

source: Creating superuser...
tr: Süper kullanıcı oluşturuluyor...

source: Superuser '{username}' already exists.
tr: '{username}' adlı süper kullanıcı zaten mevcut.

source: Enter Superuser's username:
tr: Süper kullanıcı kullanıcı adını girin:

source: Enter Superuser's password:
tr: Süper kullanıcı parolasını girin:

source: Enter Superuser's password (repeat):
tr: Süper kullanıcı parolasını tekrar girin:

source: Password cannot be empty.
tr: Parola boş olamaz.

source: Username cannot be empty.
tr: Kullanıcı adı boş olamaz.

source: Enter Superuser's email:
tr: Süper kullanıcı e-posta adresini girin:

source: Email cannot be empty.
tr: E-posta boş olamaz.

source: Invalid email format. Example: user@example.com
tr: Geçersiz e-posta formatı. Örnek: user@example.com

source: Passwords does not match
tr: Parolalar eşleşmiyor

source: Error while managing service 'soon': {e}
tr: soon servisi yönetilirken hata oluştu: {e}

source: Welcome to soon post installation configuration.
tr: Soon kurulum sonrası yapılandırmaya hoş geldiniz.

source: 1) Make sure TLS_REQCERT is allowed for ldap connections
tr: 1) LDAP bağlantıları için TLS_REQCERT'in 'allow' olarak ayarlandığından emin olun

source: The file `{LDAP_CONF}` will be modified. A backup will be created before each edit
tr: `{LDAP_CONF}` dosyası değiştirilecek. Her düzenlemeden önce yedek oluşturulacaktır

source: Allow the modification? If you want to modify it yourself type `n/no`
tr: Değişikliğe izin verilsin mi? Kendi başınıza düzenlemek isterseniz `n/no` yazın

source: 2) Create an env file here: `{ENV_PATH}`. A backup will be created before each edit
tr: 2) Burada bir env dosyası oluşturulacak: `{ENV_PATH}`. Her düzenlemeden önce yedek oluşturulacaktır

source: SoonMachine="controller.domain.ext" # If available
tr: SoonMachine="controller.domain.ext" # Varsa

source: 2.1) Create Certification and Certifier GPO
tr: 2.1) Sertifika ve Sertifikalandırıcı (Certifier) GPO oluşturma

source: Will create a certification via openssl.
tr: OpenSSL kullanarak bir sertifika oluşturulacak.

source: Certification would ve used for logon/logoff scripts signing.
tr: Sertifika, oturum açma/kapama betiklerinin imzalanmasında kullanılacaktır.

source: Allow creation of the certification? If you want to do it yourself type `n/no`
tr: Sertifika oluşturulmasına izin verilsin mi? Kendi başınıza yapmak isterseniz `n/no` yazın

source: 3) Configure Django server
tr: 3) Django sunucusunu yapılandırma

source: Will `makemigrations`, `migrate` and `createsuperuser`
tr: `makemigrations`, `migrate` ve `createsuperuser` çalıştırılacak

source: You can use Super User created here to login to django admin panel http://[THIS-MACHINES-IP]:8006/admin
tr: Burada oluşturulan Süper Kullanıcıyı Django yönetim paneline giriş için kullanabilirsiniz: http://[THIS-MACHINES-IP]:8006/admin

source: Create user's and copy their apikeys.
tr: Kullanıcı oluşturun ve API anahtarlarını kopyalayın.

source: Allow configuration? If you want to configure it yourself type `n/no`
tr: Yapılandırmaya izin verilsin mi? Kendi başınıza yapılandırmak isterseniz `n/no` yazın

source: 4) Soon Service
tr: 4) Soon Servisi

source: Will enable and start the soon's service
tr: Soon servisi etkinleştirilecek ve başlatılacaktır

source: Allow to enable and start soon service? If you want to do it yourself type `n/no`
tr: Soon servisini etkinleştirip başlatmaya izin verilsin mi? Kendi başınıza yapmak isterseniz `n/no` yazın
